# Writing to Databases with Python

In this notebook, we will explore how to write data to a SQL database using pandas and SQLAlchemy. This involves preparing a pandas DataFrame and using SQLAlchemy to manage the database connection.

## Setup

To begin, ensure that you have installed the following libraries:

- pandas: A powerful data analysis and manipulation library for Python.
- SQLAlchemy: A SQL toolkit and Object-Relational Mapping (ORM) library for Python.

Here we import the libraries and check the SQLAlchemy version to ensure that our environment is set up correctly:

In [1]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
print('sqlalchemy version = ', sqlalchemy.__version__)

sqlalchemy version =  2.0.23

After setting up our environment and importing the necessary libraries, we can start working with the data.

In [2]:
connection_string = 'mysql+pymysql://root:college@localhost/employees'
engine = create_engine(connection_string)

query = """
    SELECT *
    FROM employees e 
    JOIN salaries s 
    ON e.emp_no = s.emp_no 
    WHERE e.hire_date > '1998-01-01';
"""

df = pd.read_sql(sql=query,con=engine)
df

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,salary,from_date,to_date
0,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,44276,1999-04-30,2000-04-29
1,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,46946,2000-04-29,2001-04-29
2,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,46775,2001-04-29,2002-04-29
3,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,50032,2002-04-29,9999-01-01
4,10105,1962-02-05,Hironoby,Piveteau,M,1999-03-23,10105,59258,1999-05-17,2000-05-16
...,...,...,...,...,...,...,...,...,...,...
20793,499924,1963-06-08,Angus,Swan,M,1998-08-04,499924,43845,2000-08-03,2001-08-03
20794,499924,1963-06-08,Angus,Swan,M,1998-08-04,499924,47398,2001-08-03,9999-01-01
20795,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,499987,52282,1999-12-21,2000-12-19
20796,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,499987,54221,2000-12-19,2001-12-19
20797,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,499987,56336,2001-12-19,9999-01-01

## Preprocessing Data for Database Insertion

Before we can insert data into the database, we need to ensure that our DataFrame does not have any issues that could cause the insertion to fail. This includes checking for duplicate column names, as shown in the following code:

In [3]:
# First, we get all the column names into a list
column_names = df.columns.tolist()

# Now, find the index of the second occurrence of 'emp_no'
# This will give us the position of the duplicate 'emp_no' column
duplicate_column_index = column_names.index('emp_no', column_names.index('emp_no') + 1)
print(duplicate_column_index)

# Rename the duplicate 'emp_no' column by modifying the list
column_names[duplicate_column_index] = 'emp_no_1'

# Assign the modified list back to the DataFrame
df.columns = column_names
df

6

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no_1,salary,from_date,to_date
0,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,44276,1999-04-30,2000-04-29
1,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,46946,2000-04-29,2001-04-29
2,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,46775,2001-04-29,2002-04-29
3,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,50032,2002-04-29,9999-01-01
4,10105,1962-02-05,Hironoby,Piveteau,M,1999-03-23,10105,59258,1999-05-17,2000-05-16
...,...,...,...,...,...,...,...,...,...,...
20793,499924,1963-06-08,Angus,Swan,M,1998-08-04,499924,43845,2000-08-03,2001-08-03
20794,499924,1963-06-08,Angus,Swan,M,1998-08-04,499924,47398,2001-08-03,9999-01-01
20795,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,499987,52282,1999-12-21,2000-12-19
20796,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,499987,54221,2000-12-19,2001-12-19
20797,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,499987,56336,2001-12-19,9999-01-01

### Grouping and Aggregating Data
Before writing the data back to the database, it might be necessary to perform some aggregations.

In [4]:
# Now we can safely perform the groupby operation
max_salaries = df.groupby(['emp_no', 'first_name', 'last_name'])['salary'].max().reset_index()
max_salaries

      emp_no first_name  last_name  salary
0      10019    Lillian    Haddadi   50032
1      10105   Hironoby   Piveteau   61514
2      10139      Ewing      Foong   50398
3      10240      Remko  Maccarone   78218
4      10298   Dietrich    DuCasse   43923
...      ...        ...        ...     ...
5660  499610   Kiyokazu   Vernadat   88013
5661  499861    Subhash    Barriga   40000
5662  499888     Hilari     Smeets   45235
5663  499924      Angus       Swan   47398
5664  499987      Rimli     Dusink   56336

[5665 rows x 4 columns]

### Writing to Database using `.to_sql()`

Finally, we write the aggregated data back to the database using the to_sql() method.

The if_exists='fail' parameter will raise an error if the table max_salary already exists. Change this parameter to replace or append based on your requirement. Make sure to exclude the DataFrame index from the SQL table unless it is meaningful data by setting index=False.

In [5]:
# Now we can use `to_sql()` to write to our Database
# If "max_salaries" table already exists in database, fail. Hence, `if_exists= 'fail'`.
max_salaries.to_sql(name='max_salary', con=engine, if_exists= 'fail', index= False)

5665

#### Sorting Data

After calculating the maximum salaries, we may want to sort the data before writing to the database.

In [6]:
max_salaries_sorted = max_salaries.sort_values(by='salary', ascending=False)
max_salaries_sorted

      emp_no first_name    last_name  salary
1350   82109    Premsyl       Nergos  125014
3153  267005     Filipe     Condotta  124516
43     12643     Morrie    Schurmann  120062
4516  439925      Marla         Luga  118920
3615  291515       Arne     Clouatre  116911
...      ...        ...          ...     ...
1160   72491     Ulises  Tischendorf   40000
1157   72346     Garnet      Litecky   40000
1619   95041     Menkae    Underwood   40000
4919  460565      Basim       Sgarro   40000
909    59605   Boguslaw       Rattan   40000

[5665 rows x 4 columns]

#### Replacing Table in Database
To overwrite an existing table with a new DataFrame, we use the replace option in the `to_sql(if_exists= 'replace')` method.

In [7]:
# When replacing the data in an existing table toggle the settings to `if_exists= 'replace'` to add to the table
max_salaries.to_sql(name='max_salary', con=engine, if_exists= 'replace', index= False)
max_salaries_1 = pd.read_sql(sql='SELECT * FROM max_salary', con=engine)

In [8]:
max_salaries.shape, max_salaries_1.shape

((5665, 4), (5665, 4))

#### Appending data to table 
If we want to add more rows to the existing table, we use the append option. `.to_sql(if_exists= 'append')`

In [9]:
# When writing to an existing table, we can toggle the settings to `if_exists= 'append'` to add to the table
max_salaries_plus = max_salaries.copy()
max_salaries_plus['salary'] = max_salaries_plus['salary'] + 100_000
max_salaries_plus.to_sql(name='max_salary', con=engine, if_exists='append', index=False)

5665

In [11]:
max_salaries_plus

      emp_no first_name  last_name  salary
0      10019    Lillian    Haddadi  150032
1      10105   Hironoby   Piveteau  161514
2      10139      Ewing      Foong  150398
3      10240      Remko  Maccarone  178218
4      10298   Dietrich    DuCasse  143923
...      ...        ...        ...     ...
5660  499610   Kiyokazu   Vernadat  188013
5661  499861    Subhash    Barriga  140000
5662  499888     Hilari     Smeets  145235
5663  499924      Angus       Swan  147398
5664  499987      Rimli     Dusink  156336

[5665 rows x 4 columns]

In [12]:
max_salaries_2 = pd.read_sql(sql='SELECT * FROM max_salary', con=engine)
max_salaries_2

       emp_no first_name  last_name  salary
0       10019    Lillian    Haddadi   50032
1       10105   Hironoby   Piveteau   61514
2       10139      Ewing      Foong   50398
3       10240      Remko  Maccarone   78218
4       10298   Dietrich    DuCasse   43923
...       ...        ...        ...     ...
11325  499610   Kiyokazu   Vernadat  188013
11326  499861    Subhash    Barriga  140000
11327  499888     Hilari     Smeets  145235
11328  499924      Angus       Swan  147398
11329  499987      Rimli     Dusink  156336

[11330 rows x 4 columns]

#### Modifying Data and Replacing Table
Sometimes, you may need to modify the DataFrame and replace the table in the database.

Adding new columns will require `.to_sql(if_exists='replace')`

In [13]:
max_salaries.to_sql(name='max_salary', con=engine, if_exists= 'replace', index= False)
max_salaries

      emp_no first_name  last_name  salary
0      10019    Lillian    Haddadi   50032
1      10105   Hironoby   Piveteau   61514
2      10139      Ewing      Foong   50398
3      10240      Remko  Maccarone   78218
4      10298   Dietrich    DuCasse   43923
...      ...        ...        ...     ...
5660  499610   Kiyokazu   Vernadat   88013
5661  499861    Subhash    Barriga   40000
5662  499888     Hilari     Smeets   45235
5663  499924      Angus       Swan   47398
5664  499987      Rimli     Dusink   56336

[5665 rows x 4 columns]

This code snippet shows how to add a take_home_salary column after a hypothetical tax deduction and a created_date column before replacing the table in the database with this updated data.

In [14]:
# Addiing take_home_salary column after 30% tax.
max_salaries['take_home_salary'] = max_salaries['salary'] * (1 - 0.30)
max_salaries

      emp_no first_name  last_name  salary  take_home_salary
0      10019    Lillian    Haddadi   50032           35022.4
1      10105   Hironoby   Piveteau   61514           43059.8
2      10139      Ewing      Foong   50398           35278.6
3      10240      Remko  Maccarone   78218           54752.6
4      10298   Dietrich    DuCasse   43923           30746.1
...      ...        ...        ...     ...               ...
5660  499610   Kiyokazu   Vernadat   88013           61609.1
5661  499861    Subhash    Barriga   40000           28000.0
5662  499888     Hilari     Smeets   45235           31664.5
5663  499924      Angus       Swan   47398           33178.6
5664  499987      Rimli     Dusink   56336           39435.2

[5665 rows x 5 columns]

In [15]:
# Add a creation date to the DataFrame
import datetime as dt

# Format the current date to include the year, month, and day
current_date = dt.datetime.now().strftime('%Y-%m-%d')

# Add the formatted date to the 'created_date' column in the DataFrame
max_salaries['created_date'] = current_date
max_salaries

      emp_no first_name  last_name  salary  take_home_salary created_date
0      10019    Lillian    Haddadi   50032           35022.4   2023-11-08
1      10105   Hironoby   Piveteau   61514           43059.8   2023-11-08
2      10139      Ewing      Foong   50398           35278.6   2023-11-08
3      10240      Remko  Maccarone   78218           54752.6   2023-11-08
4      10298   Dietrich    DuCasse   43923           30746.1   2023-11-08
...      ...        ...        ...     ...               ...          ...
5660  499610   Kiyokazu   Vernadat   88013           61609.1   2023-11-08
5661  499861    Subhash    Barriga   40000           28000.0   2023-11-08
5662  499888     Hilari     Smeets   45235           31664.5   2023-11-08
5663  499924      Angus       Swan   47398           33178.6   2023-11-08
5664  499987      Rimli     Dusink   56336           39435.2   2023-11-08

[5665 rows x 6 columns]

In [17]:
# Replace the table with the updated DataFrame
max_salaries.to_sql(name='max_salary', con=engine, if_exists='replace', index=False)

# Read the new table to confirm
new_df = pd.read_sql(sql='SELECT * FROM max_salary', con=engine)
new_df

      emp_no first_name  last_name  salary  take_home_salary created_date
0      10019    Lillian    Haddadi   50032           35022.4   2023-11-08
1      10105   Hironoby   Piveteau   61514           43059.8   2023-11-08
2      10139      Ewing      Foong   50398           35278.6   2023-11-08
3      10240      Remko  Maccarone   78218           54752.6   2023-11-08
4      10298   Dietrich    DuCasse   43923           30746.1   2023-11-08
...      ...        ...        ...     ...               ...          ...
5660  499610   Kiyokazu   Vernadat   88013           61609.1   2023-11-08
5661  499861    Subhash    Barriga   40000           28000.0   2023-11-08
5662  499888     Hilari     Smeets   45235           31664.5   2023-11-08
5663  499924      Angus       Swan   47398           33178.6   2023-11-08
5664  499987      Rimli     Dusink   56336           39435.2   2023-11-08

[5665 rows x 6 columns]